
technic = [("Ноутбук", 1500, "Татьяна", "89002001020"),
           ("Смартфон", 500, "Анна", "89202202325"),
           ("Проектор", 300, "Андрей", "89505205656"),
           ("Принтер", 750, "Игорь", "89303303236"),
           ("Смартфон", 1000, "Андрей", "89505205656"),
           ("Ноутбук", 4800, "Татьяна", "89002001020"),
           ("Наушники", 780, "Марина", "89562002350"),
           ("Сканер", 550, "Сергей", "89808564559"),
           ("Планшет", 1200, "Анна", "89202202325"),
           ("Ноутбук", 1100, "Игорь", "89303303236"),
           ("Смартфон", 3500, "Татьяна", "89002001020")
           ]


def create_lst(lst):
    dct = {}
    for i in lst:
        key = f"{i[2]} {i[3]}"
        value = f'{i[0]} - {i[1]}'
        if key not in dct:
            dct[key] = [value]
        else:
            dct[key].append(value)

    for i in dct:
        str = "; ".join(dct[i])
        print(i + ": " + str)

create_lst(technic)